'use strict';


const { Controller } = require('egg');
const list = [{
  title: '我校隆重举行秋季学期开学典礼',
  desc: '2020年9月1日清晨，阳光明媚，秋高气爽。我校4100多师生相聚在共青湖畔美丽的两中校园怀，2020年9月1日清晨，阳光明媚，秋高气爽。我校4100多师生相聚在共青湖畔美丽的两中校园怀',
  id: 1
}, {
  title: '我校隆重举行秋季学期开学典礼',
  desc: '2020年9月1日清晨，阳光明媚，秋高气爽。我校4100多师生相聚在共青湖畔美丽的两中校园怀',
  id: 2
}, {
  title: '我校隆重举行秋季学期开学典礼',
  desc: '2020年9月1日清晨，阳光明媚，秋高气爽。我校4100多师生相聚在共青湖畔美丽的两中校园怀',
  id: 3
}, {
  title: '我校隆重举行秋季学期开学典礼',
  desc: '2020年9月1日清晨，阳光明媚，秋高气爽。我校4100多师生相聚在共青湖畔美丽的两中校园怀',
  id: 4
}, {
  title: '我校隆重举行秋季学期开学典礼',
  desc: '2020年9月1日清晨，阳光明媚，秋高气爽。我校4100多师生相聚在共青湖畔美丽的两中校园怀',
  id: 5
}, {
  title: '我校隆重举行秋季学期开学典礼',
  desc: '2020年9月1日清晨，阳光明媚，秋高气爽。我校4100多师生相聚在共青湖畔美丽的两中校园怀',
  id: 6
}, {
  title: '我校隆重举行秋季学期开学典礼',
  desc: '2020年9月1日清晨，阳光明媚，秋高气爽。我校4100多师生相聚在共青湖畔美丽的两中校园怀',
  id: 7
}]

class NewsController extends Controller {
  async index() {
    const res = {
      code: 0,
      msg: '请求成功',
      data: {
        list
      },
    };
    ctx.body = { ...res }
  }
}

module.exports = NewsController;
